[
	{
		"title": "Start",
		"tags": "bg:room left:s early",
		"body": "Start the game?\n[[ at beginning |wakeup]] [[ to city|Going_to_street]]",
		"position": {
			"x": 378,
			"y": 447
		},
		"colorID": 0
	},
	{
		"title": "Going_in_school",
		"tags": "bg:school etr",
		"body": "The school looked unusually empty today\n<<if $a.s.isWorried>>\ns: Oh we are in trouble now!\nm: Calm down, we will just go to the next class\n<<endif>>\nThe two walked into class",
		"position": {
			"x": 365,
			"y": -15
		},
		"colorID": 0
	},
	{
		"title": "Going_to_street",
		"tags": "bg:street left:m right:s",
		"body": "// here the tag bg:street is set to trigger the background to change when the node is visited\nThe two decided to skip the first class\ns shocked: This doesnt feel right\nm smile: It's fine dont worry about it\ns shocked: but what if we get expelled?\nm laugh: What, for this? Don't be ridiculous.\ns: I want to start over!\n<<set $a.s.isWorried=true>> \nWanna start over?\n[[ Yes, restart the day |Start]][[ No, lets go to school|Going_in_school]]",
		"position": {
			"x": 767,
			"y": 182
		},
		"colorID": 0
	},
	{
		"title": "wakeup",
		"tags": "",
		"body": "// dont show any actor avatars, we just set them up in tags left:s, however no active actor is speaking\nIt was a quiet morning when knocks were heard\n// since active actor m is not assigned to left nor right, they are treated as off screen\nm: Hey, are you ready? We are going to be late (offscreen)\n// now show active actor s avatar on the left (as set in tags)\ns: Zzzzz, L-late.. Go away!\n// m doesnt show up yet because he hasnt been assigned to left or right\nm: Seriously, you need to get ready. The bus will be here\n// now since theres no active actor, dont show any avatars\nSutemo begrudgingly got up and looked out of the window.(r is gone)\nThere was a bus outside\ns shocked: C-crap! (change face to shocked)\ns angry: Ok wait a second! (change face to angry)\n// here his avatar wont be visible because we set right to =\"\"\nm: I told ya!\nA few minutes later Sutemo was ready...\n// here we travel to the school mid-dialog by using the scene command\n<<scene bg=school>>\n// since actors store their info in yarn state, you can override it mid dialog without even needing to set up commands\n<<set $a.s.outfit=\"hoodie\">> \n<<set $a.s.face=\"smile\">> \n// here m shows on the right, as we used the \"right\" word. This assigns him to the right avatar\nm idle right: Are you ok?\nm laugh: I felt like you freaked out earlier..\ns smile left: I feel much better now!\nm: Your mood does tend to improve after breakfast.\ns angry: Shut up, baka!\nm idle: ...\ns shocked: what?\nm smile: You watch too much anime...\ns angry: nuh-uh.. anyways the class is about to start.\nm: shall we go in?\n[[ yes lets go to school |Going_in_school]] [[ Lets take a walk first |Going_to_street]]",
		"position": {
			"x": -2,
			"y": 182
		},
		"colorID": 0
	}
]